<details>
<summary>Execution result of "run --all --non-interactive --summary-per-unit --log-level stderr --log-format bare -- plan" in "IaC/production/homelab"</summary>

```terraform

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.metallb_system: Refreshing state... [id=metallb-system]
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
helm_release.metallb: Refreshing state... [id=metallb]
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.longhorn_system: Refreshing state... [id=longhorn-system]
helm_release.nfs_database: Refreshing state... [id=nfs-subdir-external-provisioner-database]
helm_release.nfs_subdir_external_provisioner: Refreshing state... [id=nfs-subdir-external-provisioner]
helm_release.nfs_media: Refreshing state... [id=nfs-subdir-external-provisioner-media]
helm_release.longhorn: Refreshing state... [id=longhorn]
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
kubernetes_namespace_v1.metrics: Refreshing state... [id=metrics-server]
kubernetes_namespace_v1.external_secrets: Refreshing state... [id=external-secrets]
helm_release.release: Refreshing state... [id=metrics-server]
kubernetes_secret_v1.name: Refreshing state... [id=external-secrets/aws-ssm-secret]
helm_release.release: Refreshing state... [id=external-secrets]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
kubernetes_manifest.ip_address_pool: Refreshing state...
kubernetes_manifest.l2_advertisement: Refreshing state...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
kubernetes_manifest.external_secrets_secret_store: Refreshing state...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
kubernetes_namespace_v1.traefik: Refreshing state... [id=traefik]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
helm_release.traefik: Refreshing state... [id=traefik]
kubernetes_manifest.traefik_certificate: Refreshing state...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.argocd: Refreshing state... [id=argocd]
helm_release.argocd_image_updater: Refreshing state... [id=argocd-image-updater]
helm_release.release: Refreshing state... [id=argocd]
aws_ssm_parameter.argocd["client_secret"]: Refreshing state... [id=/homelab/argocd/client_secret]
kubernetes_manifest.argocd_certificate: Refreshing state...
kubernetes_manifest.argocd_secret: Refreshing state...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)

OpenTofu planned the following actions, but then encountered a problem:

  # helm_release.argocd_image_updater will be updated in-place
  ~ resource "helm_release" "argocd_image_updater" {
      ~ id                         = "argocd-image-updater" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v1.0.2" -> (known after apply)
          ~ chart          = "argocd-image-updater" -> (known after apply)
          ~ first_deployed = 1754265078 -> (known after apply)
          ~ last_deployed  = 1767400104 -> (known after apply)
          ~ name           = "argocd-image-updater" -> (known after apply)
          ~ namespace      = "argocd" -> (known after apply)
          ~ notes          = "" -> (known after apply)
          ~ revision       = 16 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - extraArgs = [
                      - "--interval",
                      - "2m",
                    ]
                }
            ) -> (known after apply)
          ~ version        = "1.0.4" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd-image-updater"
      ~ set_wo                     = (write-only attribute)
      ~ version                    = "1.0.4" -> "1.0.5"
        # (27 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
╷
│ Error: Error getting release
│ 
│   with helm_release.release,
│   on main.tf line 10, in resource "helm_release" "release":
│   10: resource "helm_release" "release" {
│ 
│ Unable to get Helm release argocd: query: failed to query with labels:
│ stream error when reading response body, may be caused by closed
│ connection. Please retry. Original error: stream error: stream ID 15;
│ INTERNAL_ERROR; received from peer
╵

❯❯ Run Summary  21 units  2m
   ────────────────────────────
   Succeeded (6)
      external-secrets .. 17s
      metallb ........... 13s
      traefik ........... 10s
      metrics ........... 10s
      longhorn .......... 7s
      storage ........... 6s
   Failed (1)
      argocd ............ 2m
   Early Exits (14)
      open-webui ........ 4µs
      tailscale ......... 4µs
      homarr ............ 2µs
      cloudflare-tunnel . 2µs
      cert-manager ...... 2µs
      minecraft ......... 2µs
      octobot ........... 1µs
      technitium ........ 992ns
      n8n ............... 922ns
      database .......... 811ns
      litellm ........... 671ns
      homeassistant ..... 611ns
      descheduler ....... 471ns
      monitoring ........ 451ns
```

</details>
    
